// /*----------------------------------------------------------
// This Source Code Form is subject to the terms of the
// Mozilla Public License, v.2.0. If a copy of the MPL
// was not distributed with this file, You can obtain one
// at http://mozilla.org/MPL/2.0/.
// ----------------------------------------------------------*/

using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using ScriptEngine.HostedScript;
using ScriptEngine.HostedScript.Library;

namespace dataserver
{
    class dbaccess: functions 
    {

        public readonly string ИмяФайлаДанных;
        string КаталогФайловДанных;
        ФайловыйПоток ПотокДанных;
        public DateTime ВремяИзменения;

        // открыть контейнер для чтения или записи
        public bool ОткрытьПотокДанных(bool ДляЗаписи = false, object Позиция = null)
        {

            try
            {

                if (ДляЗаписи)
                {

                    if (!(ПотокДанных == Неопределено))
                    {
                        if (!(ПотокДанных.ДоступнаЗапись))
                        {
                            ПотокДанных.Закрыть();
                            ПотокДанных = null;
                        }
                    }

                    if (ПотокДанных == Неопределено)
                    {
                        ПотокДанных = ФайловыеПотоки.ОткрытьДляЗаписи(ИмяФайлаДанных);
                    }

                    if (Позиция == Неопределено)
                    {
                        ПотокДанных.Перейти(0, ПозицияВПотоке.Конец);
                    }
                    else
                    {
                        ПотокДанных.Перейти((long)Позиция, ПозицияВПотоке.Начало);
                    }

                    ВремяИзменения = ТекущаяДата();

                }
                else
                {

                    if (!(ПотокДанных == Неопределено))
                    {
                        if (!(ПотокДанных.ДоступноЧтение))
                        {
                            ПотокДанных.Закрыть();
                            ПотокДанных = null;
                        }
                    }

                    if (ПотокДанных == Неопределено)
                    {
                        ПотокДанных = ФайловыеПотоки.ОткрытьДляЧтения(ИмяФайлаДанных);
                    }

                    if (!(Позиция == Неопределено))
                    {
                        ПотокДанных.Перейти((long)Позиция, ПозицияВПотоке.Начало);
                    }

                }

                return Истина;

            }
            catch (Exception e)
            {

                Сообщить(ОписаниеОшибки(e));
                return Ложь;

            }

        }


        // Получить заголовки из контейнера
        public Структура ПолучитьЗаголовки()
        {

            ОткрытьПотокДанных();

            if (ПотокДанных == Неопределено)
            {
                return null;
            }

            var Индекс = 0;
            var Результат = Новый_Структура();

            var ПозицияДанных = ПотокДанных.Размер();

            while (ПозицияДанных > 12)
            {

                ПотокДанных.Перейти(ПозицияДанных - 12, ПозицияВПотоке.Начало);

                var Буфер = Новый_БуферДвоичныхДанных(8);
                ПотокДанных.Прочитать(Буфер, 0, 8);
                ПозицияДанных = (long)Буфер.ПрочитатьЦелое64(0);

                Буфер = Новый_БуферДвоичныхДанных(4);
                ПотокДанных.Прочитать(Буфер, 0, 4);
                int ТипДанных = Буфер.ПрочитатьЦелое32(0);

                if (ТипДанных == 1)
                { // Заголовок
                    var дЗаголовок = ПолучитьДанные(ПозицияДанных);
                    Результат.Вставить("З" + Индекс, ДвоичныеДанныеВСтруктуру(дЗаголовок));
                    Индекс = Индекс + 1;
                }

            }

            return Результат;

        } // ПолучитьЗаголовки()


        // найти заголовок по условиям
        public object НайтиЗаголовок(dynamic ЗапросДанных)
        {

            string ТолькоОдин = "";
            Перем _Позиция = null;
            Перем _ЧислоЗаписей = null;
            Перем _ПозицияДанных = null;
            Перем _Направление = null;
            long Позиция;
            long ЧислоЗаписей;
            long ПозицияДанных;
            string Направление;
            Перем УсловияОтбора = null;

            ОткрытьПотокДанных();

            if (ПотокДанных == Неопределено)
            {
                return "ОшибкаПотокаДанных";
            }

            ЗапросДанных.Свойство("УсловияОтбора", ref УсловияОтбора);
            if (ТипЗнч(УсловияОтбора) == Тип("Структура"))
            {
                if ((УсловияОтбора as Структура).Количество() == 0)
                {
                    УсловияОтбора = null;
                }
            }
            else
            {
                УсловияОтбора = null;
            }

            ЗапросДанных.Свойство("ПозицияДанных", ref _ПозицияДанных);
            ЗапросДанных.Свойство("Направление", ref _Направление);

            Направление = Строка(_Направление);
            if (Направление == "")
            {
                Направление = "Назад";
            }

            if (_ПозицияДанных == null)
            {
                ЗапросДанных.Свойство("НачальнаяПозиция", ref _ПозицияДанных);
            }

            long Размер = ПотокДанных.Размер();

            try
            {
                ПозицияДанных = (Int32)Число(_ПозицияДанных);
            }
            catch
            {
                ПозицияДанных = Размер;
            }

            if (ЗапросДанных.Свойство("ПоследняяПозиция", ref _Позиция))
            {
                Позиция = (Int32)Число(_Позиция);
            }
            else
            {
                Позиция = 0;
            }

            if (ЗапросДанных.Свойство("ЧислоЗаписей", ref _ЧислоЗаписей))
            {
                ЧислоЗаписей = (Int32)Число(_ЧислоЗаписей);
            }
            else
            {
                ЧислоЗаписей = 1;
            }

            //Позиция = Число(Позиция);
            //ЧислоЗаписей = Число(ЧислоЗаписей);

            ЗапросДанных.Вставить("ПоследняяПозиция", Позиция);
            ЗапросДанных.Вставить("ЗаголовокНайден", Ложь);
            var ЗаголовокНайден = Ложь;

            var ВремяНачало = ТекущаяУниверсальнаяДатаВМиллисекундах();
            var ЗаписейПрочитано = 0;

            var Результат = "ЗапросВыполняется";

            dynamic Запись = null;

            object Завершен = null;

            while (Истина)
            {

                Завершен = (!((ПозицияДанных > 12 && Направление == "Назад") || (ПозицияДанных + 4 < Размер && Направление == "Вперед")) || (Позиция == ЧислоЗаписей));

                // превышение времени ожидания ответа
                if (ТекущаяУниверсальнаяДатаВМиллисекундах() - ВремяНачало > 50)
                {
                    break;
                }

                if ((bool)Завершен)
                {
                    break;
                }

                ПотокДанных.Перейти(ПозицияДанных - 12, ПозицияВПотоке.Начало);

                var Буфер = Новый_БуферДвоичныхДанных(8);
                ПотокДанных.Прочитать(Буфер, 0, 8);
                var зПозицияДанных = (long)Буфер.ПрочитатьЦелое64(0);

                Буфер = Новый_БуферДвоичныхДанных(4);
                ПотокДанных.Прочитать(Буфер, 0, 4);
                var ТипДанных = Буфер.ПрочитатьЦелое32(0);

                ЗаписейПрочитано = ЗаписейПрочитано + 1;

                if (Направление == "Назад")
                {
                    ПозицияДанных = зПозицияДанных;
                }
                else
                {
                    ПотокДанных.Перейти(ПозицияДанных, ПозицияВПотоке.Начало);
                    Буфер = Новый_БуферДвоичныхДанных(4);
                    ПотокДанных.Прочитать(Буфер, 0, 4);
                    var Объем = Буфер.ПрочитатьЦелое32(0);
                    ПозицияДанных = ПозицияДанных + 4 + Объем + 12;
                }

                if (ТипДанных == 1)
                { // Заголовок

                    var дЗаголовок = ПолучитьДанные(зПозицияДанных);
                    var Заголовок = ДвоичныеДанныеВСтруктуру(дЗаголовок) as Структура;

                    // возвращает первое совпадение
                    if (!(УсловияОтбора == Неопределено))
                    {
                        Перем СвойствоЗначение = null;
                        ЗаголовокНайден = Ложь;
                        foreach (dynamic элУсловия in УсловияОтбора as Структура)
                        {
                            if (элУсловия.Ключ == "ТолькоОдин")
                            {
                                ТолькоОдин = элУсловия.Значение.Значение;
                            }
                            else if (Заголовок.Свойство(элУсловия.Ключ, ref СвойствоЗначение))
                            {
                                if (элУсловия.Значение.Сравнение == "Равно")
                                {
                                    ЗаголовокНайден = (СвойствоЗначение == элУсловия.Значение.Значение);
                                }
                                if (!(ЗаголовокНайден))
                                {
                                    break;
                                }
                            }
                        }
                    }
                    else
                    {
                        ЗаголовокНайден = Истина;
                    }

                    if (ЗаголовокНайден)
                    {
                        if (Запись == Неопределено)
                        {
                            ЗапросДанных.Вставить("ЗаголовокНайден", Истина);
                            Запись = ЗапросДанных;
                        }
                        else
                        {
                            Запись.Вставить("Соседний", Новый_Структура());
                            Запись = Запись.Соседний;
                        }
                        Позиция = Позиция + 1;
                        Запись.Вставить("Заголовок", Заголовок);
                        Запись.Вставить("Позиция", Позиция);
                        if (ТолькоОдин == "Истина")
                        {
                            break;
                        }
                    }

                }

            }

            ЗапросДанных.Вставить("ВремяПоиска", ТекущаяУниверсальнаяДатаВМиллисекундах() - ВремяНачало);
            ЗапросДанных.Вставить("ЗаписейПрочитано", ЗаписейПрочитано);

            ЗапросДанных.Вставить("ПоследняяПозиция", Позиция);
            ЗапросДанных.Вставить("ПозицияДанных", ПозицияДанных);

            if ((bool)Завершен)
            {
                Результат = "ЗапросЗавершен";
                if (ЗапросДанных.Свойство("Обновление"))
                {
                    if (ЗапросДанных.Обновление == "Авто")
                    {
                        Результат = "ЗапросПриостановлен";
                    }
                }
            }

            return Результат;

        }


        // найти заголовок по ключу
        Структура НайтиКлюч(string Ключ)
        {

            ОткрытьПотокДанных();

            if (ПотокДанных == Неопределено)
            {
                return null;
            }

            var ДанныеНайти = ПолучитьДвоичныеДанныеИзСтроки(Ключ);
            var ОбъемДанных = ДанныеНайти.Размер();
            var БуферНайти = Новый_БуферДвоичныхДанных(ОбъемДанных);

            long ПозицияДанных = ПотокДанных.Размер();

            var Результат = Новый_Структура("Результат", "ЗаголовокНеНайден");
            //Сообщить(ДанныеНайти);

            while (ПозицияДанных > 12)
            {

                ПотокДанных.Перейти(ПозицияДанных - 12, ПозицияВПотоке.Начало);

                var Буфер = Новый_БуферДвоичныхДанных(8);
                ПотокДанных.Прочитать(Буфер, 0, 8);
                ПозицияДанных = (long)Буфер.ПрочитатьЦелое64(0);

                Буфер = Новый_БуферДвоичныхДанных(4);
                ПотокДанных.Прочитать(Буфер, 0, 4);
                var ТипДанных = Буфер.ПрочитатьЦелое32(0);

                if (ТипДанных == 1)
                { // Заголовок

                    ПотокДанных.Перейти(ПозицияДанных + 4, ПозицияВПотоке.Начало);
                    ПотокДанных.Прочитать(БуферНайти, 0, ОбъемДанных);

                    if (ПолучитьДвоичныеДанныеИзБуфераДвоичныхДанных(БуферНайти) == ДанныеНайти)
                    {
                        var дЗаголовок = ПолучитьДанные(ПозицияДанных);
                        Результат.Вставить("Результат", "ЗаголовокНайден");
                        Результат.Вставить("Заголовок", дЗаголовок);
                        return Результат;
                    }

                }

            }

            return Результат;

        }


        // получить данные из контейнера и записать в файл
        bool ПолучитьФайл(long Позиция)
        {

            var ИмяФайла = ОбъединитьПути(КаталогФайловДанных, Строка(Позиция));

            var ФайлДанных = Новый_Файл(ИмяФайла);

            if (!(ФайлДанных.Существует()))
            {

                try
                {

                    ОткрытьПотокДанных(Ложь, Позиция);

                    var Буфер = Новый_БуферДвоичныхДанных(4);
                    ПотокДанных.Прочитать(Буфер, 0, 4);
                    var ОбъемДанных = Буфер.ПрочитатьЦелое32(0);

                    Буфер = Новый_БуферДвоичныхДанных(ОбъемДанных);
                    ПотокДанных.Прочитать(Буфер, 0, ОбъемДанных);

                    var ДанныеФайла = ФайловыеПотоки.ОткрытьДляЗаписи(ИмяФайла);
                    ДанныеФайла.Записать(Буфер, 0, ОбъемДанных);

                    ДанныеФайла.Закрыть();

                }
                catch (Exception e)
                {

                    Сообщить(ОписаниеОшибки(e));
                    return Ложь;

                }

            }

            return Истина;

        }


        // Удалить данные из контейнера (заголовок тип + 10000)
        public string УдалитьДанные(long Позиция)
        {

            ОткрытьПотокДанных(Ложь, Позиция);

            var Буфер = Новый_БуферДвоичныхДанных(4);
            ПотокДанных.Прочитать(Буфер, 0, 4);
            var ОбъемДанных = Буфер.ПрочитатьЦелое32(0);

            Позиция = Позиция + ОбъемДанных + 4 + 12;

            ОткрытьПотокДанных(Ложь, Позиция); // это заголовок данных

            ПотокДанных.Прочитать(Буфер, 0, 4);
            ОбъемДанных = Буфер.ПрочитатьЦелое32(0);

            ОткрытьПотокДанных(Ложь, Позиция + ОбъемДанных + 4 + 8);

            ПотокДанных.Прочитать(Буфер, 0, 4);
            int ТипДанных = Буфер.ПрочитатьЦелое32(0);

            ОткрытьПотокДанных(Истина, Позиция + ОбъемДанных + 4 + 8);
            Буфер.ЗаписатьЦелое32(0, 10000 + ТипДанных);
            ПотокДанных.Записать(Буфер, 0, 4);

            return "Успешно";

        }


        // Получить двоичные данные из контейнера
        public ДвоичныеДанные ПолучитьДанные(long Позиция, object ТипДанных = null)
        {

            ОткрытьПотокДанных(Ложь, Позиция);

            var Буфер = Новый_БуферДвоичныхДанных(4);
            ПотокДанных.Прочитать(Буфер, 0, 4);
            var ОбъемДанных = Буфер.ПрочитатьЦелое32(0);

            Буфер = Новый_БуферДвоичныхДанных(ОбъемДанных);
            ПотокДанных.Прочитать(Буфер, 0, ОбъемДанных);

            if (!(ТипДанных == Неопределено))
            { // прочитать тип данных
                var Буфер1 = Новый_БуферДвоичныхДанных(4);
                ПотокДанных.Прочитать(Буфер1, 0, 4);
                ПотокДанных.Прочитать(Буфер1, 0, 4);
                ПотокДанных.Прочитать(Буфер1, 0, 4);
                ТипДанных = Буфер1.ПрочитатьЦелое32(0);
            }

            return ПолучитьДвоичныеДанныеИзБуфераДвоичныхДанных(Буфер);

        }


        // добавить в контейнер заголовок с файлом или без
        public long ДобавитьДанные(Структура Заголовок, ДвоичныеДанные дДанные = null)
        {

            //string ИмяФайла;
            Перем ТипДанных = null;

            ОткрытьПотокДанных(Истина);

            var ПозицияДанных = ПотокДанных.ТекущаяПозиция();

            if (Заголовок.Свойство("ТипДанных", ref ТипДанных) && !(дДанные == Неопределено))
            {
                Заголовок.Вставить("ОбъемДанных", ЗаписатьДанные(дДанные, (int)Число(ТипДанных)));
                Заголовок.Вставить("ПозицияДанных", ПозицияДанных);
            }

            Заголовок.Вставить("Дата", "" + ТекущаяДата());

            var дЗаголовок = СтруктуруВДвоичныеДанные(Заголовок);

            ЗаписатьДанные(дЗаголовок);

            return ПозицияДанных;

        }


        // добавить содержимое файла в контейнер
        long ЗаписатьДанныеФайла(string ИмяФайла)
        {

            var ПозицияДанных = ПотокДанных.ТекущаяПозиция();

            var ДанныеФайла = ФайловыеПотоки.ОткрытьДляЧтения(ИмяФайла);
            var ОбъемДанных = ДанныеФайла.Размер();

            var Буфер = Новый_БуферДвоичныхДанных(4);
            Буфер.ЗаписатьЦелое32(0, (int)ОбъемДанных);
            ПотокДанных.Записать(Буфер, 0, 4);

            ДанныеФайла.КопироватьВ(ПотокДанных);
            ДанныеФайла.Закрыть();

            Буфер = Новый_БуферДвоичныхДанных(8);
            Буфер.ЗаписатьЦелое64(0, (ulong)ПозицияДанных);
            ПотокДанных.Записать(Буфер, 0, 8);

            var ТипДанных = 2; // 2 = файл

            Буфер = Новый_БуферДвоичныхДанных(4);
            Буфер.ЗаписатьЦелое32(0, ТипДанных);
            ПотокДанных.Записать(Буфер, 0, 4);

            ПотокДанных.СброситьБуферы();

            return ОбъемДанных;

        }


        // добавить двоичные данные в контейнер
        long ЗаписатьДанные(ДвоичныеДанные дДанные, int ТипДанных = 1)
        {

            var ПозицияДанных = ПотокДанных.ТекущаяПозиция();

            var ОбъемДанных = дДанные.Размер();

            var Буфер = Новый_БуферДвоичныхДанных(4);
            Буфер.ЗаписатьЦелое32(0, ОбъемДанных);
            ПотокДанных.Записать(Буфер, 0, 4);

            Буфер = ПолучитьБуферДвоичныхДанныхИзДвоичныхДанных(дДанные);
            ПотокДанных.Записать(Буфер, 0, ОбъемДанных);

            Буфер = Новый_БуферДвоичныхДанных(8);
            Буфер.ЗаписатьЦелое64(0, (ulong)ПозицияДанных);
            ПотокДанных.Записать(Буфер, 0, 8);

            Буфер = Новый_БуферДвоичныхДанных(4);
            Буфер.ЗаписатьЦелое32(0, ТипДанных); // 1 = заголовок
            ПотокДанных.Записать(Буфер, 0, 4);

            ПотокДанных.СброситьБуферы();

            return ОбъемДанных;

        }


        public dbaccess(string значКаталогФайловДанных, string значИмяФайлаДанных) : base("dbaccess")
        {
            КаталогФайловДанных = значКаталогФайловДанных;
            ИмяФайлаДанных = ОбъединитьПути(КаталогФайловДанных, значИмяФайлаДанных + ".sdb");
            var Файл = Новый_Файл(ИмяФайлаДанных);
            if (!(Файл.Существует()))
            {
                var тФайл = Новый_ТекстовыйДокумент();
                тФайл.Записать(ИмяФайлаДанных);
                Файл = Новый_Файл(ИмяФайлаДанных);
            }
            ВремяИзменения = Файл.ПолучитьВремяИзменения();
        }


    }
}
